podonoghue/SolderingStation/Software/KinetisBootloader/Project_Headers/pin_mapping.h
};

/** 
 * End group SPI_Group
 * @}
 */
/**
 * @addtogroup TSI_Group TSI, Touch Sense Interface
 * @brief Abstraction for Touch Sense Interface
 * @{
 */
#define USBDM_TSI0_IS_DEFINED
/**
 * Peripheral information for TSI, Touch Sense Interface.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Tsi0Info {
public:
   // Template:tsi0_mk

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = TSI0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<TSI_Type> tsi = baseAddress;

   //! Base value for PCR (excluding MUX value)
   static constexpr uint32_t defaultPcrValue  = 0;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   static constexpr uint32_t tsi_gencs = 
      TSI_GENCS_STPE(0)       |  // TSI STOP Enable
      TSI_GENCS_STM(0)        |  // Scan Trigger Mode
      TSI_GENCS_ESOR(1)       |  // EOS or OOR Interrupt select
      TSI_GENCS_ERIE(0)       |  // Error Interrupt Enable
      TSI_GENCS_TSIIE(0)      |  // Touch Sensing Input Interrupt Module Enable
      TSI_GENCS_PS(3)         |  // Electrode Oscillator Prescaler
      TSI_GENCS_NSCN(8-1)     |  // Consecutive Scan number
      TSI_GENCS_LPSCNITV(9)   |  // Low-Power Mode Scan Interval
      TSI_GENCS_LPCLKS(0);       // Low-Power Mode Clock Source

   static constexpr uint32_t tsi_scanc = 
      TSI_SCANC_AMPSC(3)           |  // Active Mode Prescaler
      TSI_SCANC_AMCLKS(0)          |  // Active Mode Clock Source
      TSI_SCANC_SMOD(8)            |  // Scan Period Modulus
      TSI_SCANC_EXTCHRG((16/2)-1)  |  // External Oscillator Charge Current select
      TSI_SCANC_REFCHRG((16/2)-1);    // Reference Oscillator Charge Current select

   static constexpr uint32_t tsi_pen = 
      (0x0) |    // Pins enable channel as TSI inputs
      TSI_PEN_LPSP(0);    // Low Power Scan channel

   static constexpr uint32_t tsi_threshold = 
      TSI_THRESHOLD_LTHH(0) |   // Low Power Channel Low Threshold value
      TSI_THRESHOLD_HTHH(0);    // Low Power Channel High Threshold value

   /**
    * Get input clock when configured in Active mode
    * 
    * @return frequency on Hz
    */
   static uint32_t getInputClockFrequency() {
      switch(tsi->SCANC&TSI_SCANC_AMCLKS_MASK) {
         case TSI_SCANC_AMCLKS(0):  return 1000;
         case TSI_SCANC_AMCLKS(1):  return McgInfo::getMcgIrClock();
         case TSI_SCANC_AMCLKS(2):  return Osc0Info::getOscerClock();
      }
      return 0;
   }

   /**
    * Get input clock when configured in low power mode
    * 
    * @return frequency on Hz
    */
   static uint32_t getLowPowerInputClockFrequency() {
      switch(tsi->GENCS&TSI_GENCS_LPCLKS_MASK) {
         case TSI_GENCS_LPCLKS(0):  return 1000;
         case TSI_GENCS_LPCLKS(1):  return SimInfo::getErc32kClock();
      }
      return 0;
   }

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = TSI0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Tsi0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableTsi0Clock();
#else
      SIM->SCGC5 = SIM->SCGC5 | SIM_SCGC5_TSI0_MASK;
#endif
   }

   /** 
    *  Disable clock to Tsi0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableTsi0Clock();
#else
      SIM->SCGC5 = SIM->SCGC5 & ~SIM_SCGC5_TSI0_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 16;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: TSI0_CH0             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: TSI0_CH1             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: TSI0_CH2             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: TSI0_CH3             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: TSI0_CH4             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: TSI0_CH5             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: TSI0_CH6             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   7: TSI0_CH7             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   8: TSI0_CH8             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: TSI0_CH9             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: TSI0_CH10            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  11: TSI0_CH11            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  12: TSI0_CH12            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  13: TSI0_CH13            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  14: TSI0_CH14            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: TSI0_CH15            = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

