podonoghue/SolderingStation/Software/KinetisBootloader/Project_Headers/pin_mapping.h
};

/** 
 * End group USB_Group
 * @}
 */
/**
 * @addtogroup USBDCD_Group USBDCD, USB Device Charger Detection
 * @brief Abstraction for USB Device Charger Detection
 * @{
 */
#define USBDM_USBDCD0_IS_DEFINED
/**
 * Peripheral information for USBDCD, USB Device Charger Detection.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class Usbdcd0Info {
public:
   // Template:usbdcd0_v1_1

   using USBHSDCD_Type = USBDCD_Type;

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = USBDCD0_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<USBDCD_Type> usbdcd = baseAddress;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = USBDCD0_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /** 
    *  Enable clock to Usbdcd0
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableUsbdcd0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_USBDCD_MASK;
#endif
   }

   /** 
    *  Disable clock to Usbdcd0
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableUsbdcd0Clock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_USBDCD_MASK;
#endif
   }

};

/** 
 * End group USBDCD_Group
 * @}
 */
/**
 * @addtogroup VREF_Group VREF, Voltage Reference
 * @brief Abstraction for Voltage Reference
 * @{
 */
#define USBDM_VREF_IS_DEFINED
/**
 * Peripheral information for VREF, Voltage Reference.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class VrefInfo {
public:
   // Template:vref_c

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = VREF_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<VREF_Type> vref = baseAddress;

   //! Pin number in Info table for VREF output if mapped to a pin
   static constexpr int outputPin  = 0;

   //! Map all allocated pins on a peripheral when enabled
   static constexpr bool mapPinsOnEnable = false;

   static constexpr uint8_t vref_trm = 
       VREF_TRM_CHOPEN(1); // Chop oscillator enable
       //                  // Trim bits are preserved

   static constexpr uint8_t vref_sc = 
       VREF_SC_VREFEN(1) |   // Internal Voltage Reference enable
       VREF_SC_REGEN(1) |    // Regulator enable
       VREF_SC_ICOMPEN(1) |  // Second order curvature compensation enable
       VREF_SC_MODE_LV(1);   // Buffer Mode selection 

   /** 
    *  Enable clock to Vref
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enableVrefClock();
#else
      SIM->SCGC4 = SIM->SCGC4 | SIM_SCGC4_VREF_MASK;
#endif
   }

   /** 
    *  Disable clock to Vref
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disableVrefClock();
#else
      SIM->SCGC4 = SIM->SCGC4 & ~SIM_SCGC4_VREF_MASK;
#endif
   }

   //! Number of signals available in info table
   static constexpr int numSignals  = 1;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: VREF_OUT             = VREF_OUT(p13)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group VREF_Group
 * @}
 */
/**
 * @addtogroup WDOG_Group WDOG, Watchdog Timer
 * @brief Abstraction for Watchdog Timer
 * @{
 */
#define USBDM_WDOG_IS_DEFINED
/**
 * Peripheral information for WDOG, Watchdog Timer.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class WdogInfo {
public:
   // Template:wdog_mk

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = WDOG_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<WDOG_Type> wdog = baseAddress;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = WDOG_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /**
    * Get input clock frequency
    *
    * @return Input clock frequency as a uint32_t in Hz
    */
   static uint32_t getInputClockFrequency() {
   
      switch(wdog->STCTRLH&WDOG_STCTRLH_CLKSRC_MASK) {
      default:
      case WDOG_STCTRLH_CLKSRC(0): return PmcInfo::getLpoClock(); // LPO
      case WDOG_STCTRLH_CLKSRC(1): return SystemBusClock;         // Alt = System Bus Clock
      }
   }

};

/** 
 * End group WDOG_Group
 * @}
 */
/** 
 * End group USBDM_Group
 * @}
 */

} // End namespace USBDM


// GPIO definitions are needed generally
#include "gpio.h"

///
/// @page PinSummary Pin Mapping
///
/// @section PinsByPinName Pins by Pin Name
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  RESET_b        |                               | RESET_b                                            | p26                       | Reset
///  USB0_DM        | -                             | USB0_DM                                            | p4                        | USBDM
///  USB0_DP        | -                             | USB0_DP                                            | p3                        | USBDP
///  VBAT           | -                             | VBAT                                               | p16                       | Vdd
///  VDD1           | -                             | VDD1                                               | p1                        | Vdd
///  VDD2           | -                             | VDD2                                               | p22                       | Vdd
///  VDDA           | -                             | VDDA                                               | p9                        | Vdd
///  VOUT33         | -                             | VOUT33                                             | p5                        | Vdd
///  VREFH          | -                             | VREFH                                              | p10                       | Vdd
///  VREFL          | -                             | VREFL                                              | p11                       | Vss
///  VREF_OUT       | -                             | VREF_OUT                                           | p13                       | Unused
///  VREGIN         | -                             | VREGIN                                             | p6                        | 5V_Fused
///  VSS1           | -                             | VSS1                                               | p2                        | Vss
///  VSS2           | -                             | VSS2                                               | p23                       | Vss
///  VSSA           | -                             | VSSA                                               | p12                       | Vss
///  XTAL32         | -                             | XTAL32                                             | p14                       | Unused
///
///
/// @section PinsByLocation Pins by Location
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  VDD1           | -                             | VDD1                                               | p1                        | Vdd
///  VSS1           | -                             | VSS1                                               | p2                        | Vss
///  USB0_DP        | -                             | USB0_DP                                            | p3                        | USBDP
///  USB0_DM        | -                             | USB0_DM                                            | p4                        | USBDM
///  VOUT33         | -                             | VOUT33                                             | p5                        | Vdd
///  VREGIN         | -                             | VREGIN                                             | p6                        | 5V_Fused
///  VDDA           | -                             | VDDA                                               | p9                        | Vdd
///  VREFH          | -                             | VREFH                                              | p10                       | Vdd
///  VREFL          | -                             | VREFL                                              | p11                       | Vss
///  VSSA           | -                             | VSSA                                               | p12                       | Vss
///  VREF_OUT       | -                             | VREF_OUT                                           | p13                       | Unused
///  XTAL32         | -                             | XTAL32                                             | p14                       | Unused
///  VBAT           | -                             | VBAT                                               | p16                       | Vdd
///  VDD2           | -                             | VDD2                                               | p22                       | Vdd
///  VSS2           | -                             | VSS2                                               | p23                       | Vss
///  RESET_b        |                               | RESET_b                                            | p26                       | Reset
///
///
/// @section PinsByFunction Pins by Peripheral
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  RESET_b        |                               | RESET_b                                            | p26                       | Reset
///  USB0_DM        | -                             | USB0_DM                                            | p4                        | USBDM
///  USB0_DP        | -                             | USB0_DP                                            | p3                        | USBDP
///  VBAT           | -                             | VBAT                                               | p16                       | Vdd
///  VDD1           | -                             | VDD1                                               | p1                        | Vdd
///  VDD2           | -                             | VDD2                                               | p22                       | Vdd
///  VDDA           | -                             | VDDA                                               | p9                        | Vdd
///  VOUT33         | -                             | VOUT33                                             | p5                        | Vdd
///  VREFH          | -                             | VREFH                                              | p10                       | Vdd
///  VREFL          | -                             | VREFL                                              | p11                       | Vss
///  VREF_OUT       | -                             | VREF_OUT                                           | p13                       | Unused
///  VREGIN         | -                             | VREGIN                                             | p6                        | 5V_Fused
///  VSS1           | -                             | VSS1                                               | p2                        | Vss
///  VSS2           | -                             | VSS2                                               | p23                       | Vss
///  VSSA           | -                             | VSSA                                               | p12                       | Vss
///  XTAL32         | -                             | XTAL32                                             | p14                       | Unused
///
///

#endif /* PROJECT_HEADERS_PIN_MAPPING_H */
